In [2]:
import pandas as pd  
data = {
    'Name': ['A', 'B', 'C', 'D'],
    'Age': [23, 25, 22, 28],
    'Salary': [50000, 60000, 55000, 65000]
}
df = pd.DataFrame(data)
df

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000

In [ ]:
print(df['Age'])

0    23
1    25
2    22
3    28
Name: Age, dtype: int64

0    23
1    25
2    22
3    28
Name: Age, dtype: int64

In [6]:
df[['Age','Salary']]

   Age  Salary
0   23   50000
1   25   60000
2   22   55000
3   28   65000

In [9]:
print(df)
print("=============================================")
df.iloc[0]

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================

Name          A
Age          23
Salary    50000
Name: 0, dtype: object

In [11]:
df.iloc[2]

Name          C
Age          22
Salary    55000
Name: 2, dtype: object

In [15]:
print(df)
print("=============================================")
df.loc[2]

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================

Name          C
Age          22
Salary    55000
Name: 2, dtype: object

In [ ]:
print(df.iloc[1,2]) # Index based location just like metrics

60000

In [18]:
df.iloc[1:3]

  Name  Age  Salary
1    B   25   60000
2    C   22   55000

In [19]:
df.iloc[1:3,1:3]

   Age  Salary
1   25   60000
2   22   55000

In [24]:
# loc is the label based 
print(df)
print("=============================================")
print(df.loc[2,"Salary"])

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================
55000

In [28]:
# loc is the label based 
print(df)
print("=============================================")
print(df.loc[3,"Salary"])
print(df.loc[0,"Salary"])
print(df.loc[2,"Salary"])

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================
65000
50000
55000

In [41]:
print(df)
print("=============================================")
print(df.loc[1:3]) # in 'loc' Rows with labels 1, 2, 3 (end INCLUDED)
print("=============================================")
print(df.loc[1:3,"Salary"])
print("=============================================")
print(df.iloc[1:3]) # Rows 'iloc' index based from 1,2

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================
  Name  Age  Salary
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================
1    60000
2    55000
3    65000
Name: Salary, dtype: int64
=============================================
  Name  Age  Salary
1    B   25   60000
2    C   22   55000

In [37]:
# Filtering
print(df)
print("=============================================")
df['Age']>24
print("=============================================")
df[df['Age']>24]

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================
=============================================

  Name  Age  Salary
1    B   25   60000
3    D   28   65000

In [43]:
print(df)
print("=============================================")
df2=df.set_index('Name')
df2

  Name  Age  Salary
0    A   23   50000
1    B   25   60000
2    C   22   55000
3    D   28   65000
=============================================

      Age  Salary
Name
A      23   50000
B      25   60000
C      22   55000
D      28   65000

In [53]:
print(df2.loc['A'])
print("==============================")
print(df2.loc['A':'C'])
print("==============================")
print(df2.loc['A':'C',"Age"])

Age          23
Salary    50000
Name: A, dtype: int64
==============================
      Age  Salary
Name
A      23   50000
B      25   60000
C      22   55000
==============================
Name
A    23
B    25
C    22
Name: Age, dtype: int64